{"format": "layers-model", "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v2.0.1.post1", "modelTopology": {"keras_version": "2.2.4-tf", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model", "layers": [{"name": "crepe_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1024], "dtype": "float32", "sparse": false, "ragged": false, "name": "crepe_input"}, "inbound_nodes": []}, {"name": "crepe_input_reshape", "class_name": "Reshape", "config": {"name": "crepe_input_reshape", "trainable": true, "dtype": "float32", "target_shape": [1024, 1, 1]}, "inbound_nodes": [[["crepe_input", 0, 0, {}]]]}, {"name": "crepe_conv1", "class_name": "Conv2D", "config": {"name": "crepe_conv1", "trainable": true, "dtype": "float32", "filters": 1024, "kernel_size": [512, 1], "strides": [4, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["crepe_input_reshape", 0, 0, {}]]]}, {"name": "crepe_conv1_BN", "class_name": "BatchNormalization", "config": {"name": "crepe_conv1_BN", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["crepe_conv1", 0, 0, {}]]]}, {"name": "crepe_conv1_maxpool", "class_name": "MaxPooling2D", "config": {"name": "crepe_conv1_maxpool", "trainable": true, "dtype": "float32", "pool_size": [2, 1], "padding": "valid", "strides": [2, 1], "data_format": "channels_last"}, "inbound_nodes": [[["crepe_conv1_BN", 0, 0, {}]]]}, {"name": "crepe_conv1_dropout", "class_name": "Dropout", "config": {"name": "crepe_conv1_dropout", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["crepe_conv1_maxpool", 0, 0, {}]]]}, {"name": "crepe_conv2", "class_name": "Conv2D", "config": {"name": "crepe_conv2", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [64, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["crepe_conv1_dropout", 0, 0, {}]]]}, {"name": "crepe_conv2_BN", "class_name": "BatchNormalization", "config": {"name": "crepe_conv2_BN", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["crepe_conv2", 0, 0, {}]]]}, {"name": "crepe_conv2_maxpool", "class_name": "MaxPooling2D", "config": {"name": "crepe_conv2_maxpool", "trainable": true, "dtype": "float32", "pool_size": [2, 1], "padding": "valid", "strides": [2, 1], "data_format": "channels_last"}, "inbound_nodes": [[["crepe_conv2_BN", 0, 0, {}]]]}, {"name": "crepe_conv2_dropout", "class_name": "Dropout", "config": {"name": "crepe_conv2_dropout", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["crepe_conv2_maxpool", 0, 0, {}]]]}, {"name": "crepe_conv3", "class_name": "Conv2D", "config": {"name": "crepe_conv3", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [64, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["crepe_conv2_dropout", 0, 0, {}]]]}, {"name": "crepe_conv3_BN", "class_name": "BatchNormalization", "config": {"name": "crepe_conv3_BN", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["crepe_conv3", 0, 0, {}]]]}, {"name": "crepe_conv3_maxpool", "class_name": "MaxPooling2D", "config": {"name": "crepe_conv3_maxpool", "trainable": true, "dtype": "float32", "pool_size": [2, 1], "padding": "valid", "strides": [2, 1], "data_format": "channels_last"}, "inbound_nodes": [[["crepe_conv3_BN", 0, 0, {}]]]}, {"name": "crepe_conv3_dropout", "class_name": "Dropout", "config": {"name": "crepe_conv3_dropout", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["crepe_conv3_maxpool", 0, 0, {}]]]}, {"name": "crepe_conv4", "class_name": "Conv2D", "config": {"name": "crepe_conv4", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [64, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["crepe_conv3_dropout", 0, 0, {}]]]}, {"name": "crepe_conv4_BN", "class_name": "BatchNormalization", "config": {"name": "crepe_conv4_BN", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["crepe_conv4", 0, 0, {}]]]}, {"name": "crepe_conv4_maxpool", "class_name": "MaxPooling2D", "config": {"name": "crepe_conv4_maxpool", "trainable": true, "dtype": "float32", "pool_size": [2, 1], "padding": "valid", "strides": [2, 1], "data_format": "channels_last"}, "inbound_nodes": [[["crepe_conv4_BN", 0, 0, {}]]]}, {"name": "crepe_conv4_dropout", "class_name": "Dropout", "config": {"name": "crepe_conv4_dropout", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["crepe_conv4_maxpool", 0, 0, {}]]]}, {"name": "crepe_conv5", "class_name": "Conv2D", "config": {"name": "crepe_conv5", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [64, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["crepe_conv4_dropout", 0, 0, {}]]]}, {"name": "crepe_conv5_BN", "class_name": "BatchNormalization", "config": {"name": "crepe_conv5_BN", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["crepe_conv5", 0, 0, {}]]]}, {"name": "crepe_conv5_maxpool", "class_name": "MaxPooling2D", "config": {"name": "crepe_conv5_maxpool", "trainable": true, "dtype": "float32", "pool_size": [2, 1], "padding": "valid", "strides": [2, 1], "data_format": "channels_last"}, "inbound_nodes": [[["crepe_conv5_BN", 0, 0, {}]]]}, {"name": "crepe_conv5_dropout", "class_name": "Dropout", "config": {"name": "crepe_conv5_dropout", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["crepe_conv5_maxpool", 0, 0, {}]]]}, {"name": "crepe_conv6", "class_name": "Conv2D", "config": {"name": "crepe_conv6", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [64, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["crepe_conv5_dropout", 0, 0, {}]]]}, {"name": "crepe_conv6_BN", "class_name": "BatchNormalization", "config": {"name": "crepe_conv6_BN", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["crepe_conv6", 0, 0, {}]]]}, {"name": "crepe_conv6_maxpool", "class_name": "MaxPooling2D", "config": {"name": "crepe_conv6_maxpool", "trainable": true, "dtype": "float32", "pool_size": [2, 1], "padding": "valid", "strides": [2, 1], "data_format": "channels_last"}, "inbound_nodes": [[["crepe_conv6_BN", 0, 0, {}]]]}, {"name": "crepe_conv6_dropout", "class_name": "Dropout", "config": {"name": "crepe_conv6_dropout", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["crepe_conv6_maxpool", 0, 0, {}]]]}, {"name": "crepe_flatten", "class_name": "Flatten", "config": {"name": "crepe_flatten", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["crepe_conv6_dropout", 0, 0, {}]]]}, {"name": "crepe_classifier", "class_name": "Dense", "config": {"name": "crepe_classifier", "trainable": true, "dtype": "float32", "units": 360, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["crepe_flatten", 0, 0, {}]]]}], "input_layers": [["crepe_input", 0, 0]], "output_layers": [["crepe_classifier", 0, 0]]}}, "training_config": {"loss": "binary_crossentropy", "metrics": [], "weighted_metrics": null, "sample_weight_mode": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 0.001, "decay": 0.0, "beta_1": 0.9, "beta_2": 0.999, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of22.bin", "group1-shard2of22.bin", "group1-shard3of22.bin", "group1-shard4of22.bin", "group1-shard5of22.bin", "group1-shard6of22.bin", "group1-shard7of22.bin", "group1-shard8of22.bin", "group1-shard9of22.bin", "group1-shard10of22.bin", "group1-shard11of22.bin", "group1-shard12of22.bin", "group1-shard13of22.bin", "group1-shard14of22.bin", "group1-shard15of22.bin", "group1-shard16of22.bin", "group1-shard17of22.bin", "group1-shard18of22.bin", "group1-shard19of22.bin", "group1-shard20of22.bin", "group1-shard21of22.bin", "group1-shard22of22.bin"], "weights": [{"name": "crepe_classifier/kernel", "shape": [2048, 360], "dtype": "float32"}, {"name": "crepe_classifier/bias", "shape": [360], "dtype": "float32"}, {"name": "crepe_conv1/kernel", "shape": [512, 1, 1, 1024], "dtype": "float32"}, {"name": "crepe_conv1/bias", "shape": [1024], "dtype": "float32"}, {"name": "crepe_conv1_BN/gamma", "shape": [1024], "dtype": "float32"}, {"name": "crepe_conv1_BN/beta", "shape": [1024], "dtype": "float32"}, {"name": "crepe_conv1_BN/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "crepe_conv1_BN/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "crepe_conv2/kernel", "shape": [64, 1, 1024, 128], "dtype": "float32"}, {"name": "crepe_conv2/bias", "shape": [128], "dtype": "float32"}, {"name": "crepe_conv2_BN/gamma", "shape": [128], "dtype": "float32"}, {"name": "crepe_conv2_BN/beta", "shape": [128], "dtype": "float32"}, {"name": "crepe_conv2_BN/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "crepe_conv2_BN/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "crepe_conv3/kernel", "shape": [64, 1, 128, 128], "dtype": "float32"}, {"name": "crepe_conv3/bias", "shape": [128], "dtype": "float32"}, {"name": "crepe_conv3_BN/gamma", "shape": [128], "dtype": "float32"}, {"name": "crepe_conv3_BN/beta", "shape": [128], "dtype": "float32"}, {"name": "crepe_conv3_BN/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "crepe_conv3_BN/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "crepe_conv4/kernel", "shape": [64, 1, 128, 128], "dtype": "float32"}, {"name": "crepe_conv4/bias", "shape": [128], "dtype": "float32"}, {"name": "crepe_conv4_BN/gamma", "shape": [128], "dtype": "float32"}, {"name": "crepe_conv4_BN/beta", "shape": [128], "dtype": "float32"}, {"name": "crepe_conv4_BN/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "crepe_conv4_BN/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "crepe_conv5/kernel", "shape": [64, 1, 128, 256], "dtype": "float32"}, {"name": "crepe_conv5/bias", "shape": [256], "dtype": "float32"}, {"name": "crepe_conv5_BN/gamma", "shape": [256], "dtype": "float32"}, {"name": "crepe_conv5_BN/beta", "shape": [256], "dtype": "float32"}, {"name": "crepe_conv5_BN/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "crepe_conv5_BN/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "crepe_conv6/kernel", "shape": [64, 1, 256, 512], "dtype": "float32"}, {"name": "crepe_conv6/bias", "shape": [512], "dtype": "float32"}, {"name": "crepe_conv6_BN/gamma", "shape": [512], "dtype": "float32"}, {"name": "crepe_conv6_BN/beta", "shape": [512], "dtype": "float32"}, {"name": "crepe_conv6_BN/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "crepe_conv6_BN/moving_variance", "shape": [512], "dtype": "float32"}]}]}